; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v13 ?v8)
             (pred_3 ?v11 ?v1)
             (pred_9 ?v13 ?v1)
             (pred_10 ?v12 ?v13 )
	     (pred_8 ?v13)
             (pred_7 ?v9)
             (pred_6 ?v11)
             (pred_1 ?v1)
             (pred_11 ?v13)
             (pred_4 ?v11)
             (pred_2 ?v13)
             (pred_12 ))



(:action op_3
:parameters (?v3 ?v2 ?v4 ?v10)
:precondition (and (pred_7 ?v3) (pred_7 ?v2) (pred_6 ?v4) (pred_1 ?v10)
          (pred_5 ?v3 ?v2) (pred_3 ?v4 ?v10)
                   (pred_9 ?v2 ?v10) (pred_8 ?v3) 
                   (pred_11 ?v2) (pred_4 ?v4))
:effect (and  (pred_2 ?v2) (not (pred_11 ?v2))))


(:action op_2
:parameters (?v3 ?v6)
:precondition (and (pred_7 ?v3) (pred_7 ?v6)
               (pred_8 ?v3) (pred_5 ?v3 ?v6) (pred_2 ?v6))
:effect (and (pred_8 ?v6) (not (pred_8 ?v3))))

(:action op_1
:parameters (?v3 ?v4)
:precondition (and (pred_7 ?v3) (pred_6 ?v4) 
                  (pred_8 ?v3) (pred_10 ?v4 ?v3) (pred_12 ))
:effect (and (pred_4 ?v4)
   (not (pred_10 ?v4 ?v3)) (not (pred_12 ))))


(:action op_4
:parameters (?v3 ?v5 ?v7)
:precondition (and (pred_7 ?v3) (pred_6 ?v5) (pred_6 ?v7)
                  (pred_8 ?v3) (pred_4 ?v7) (pred_10 ?v5 ?v3))
:effect (and (pred_4 ?v5) (pred_10 ?v7 ?v3)
        (not (pred_4 ?v7)) (not (pred_10 ?v5 ?v3))))

(:action op_5
:parameters (?v3 ?v4)
:precondition (and (pred_7 ?v3) (pred_6 ?v4) 
                  (pred_8 ?v3) (pred_4 ?v4))
:effect (and (pred_12 ) (pred_10 ?v4 ?v3) (not (pred_4 ?v4)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_23 obj_10 obj_32 obj_04 obj_05 obj_15 obj_27 obj_06 obj_08 obj_11 obj_25 obj_12 obj_28 obj_13 obj_22 obj_07 obj_24 obj_20 obj_17 obj_02 obj_29 obj_03 obj_26 obj_31 obj_30
    obj_01 obj_16 obj_18
    obj_14 obj_09 obj_21 obj_19
    )

    (:init
       (pred_12)

       (pred_7 obj_23)
       (pred_7 obj_10)
       (pred_7 obj_32)
       (pred_7 obj_04)
       (pred_7 obj_05)
       (pred_7 obj_15)
       (pred_7 obj_27)
       (pred_7 obj_06)
       (pred_7 obj_08)
       (pred_7 obj_11)
       (pred_7 obj_25)
       (pred_7 obj_12)
       (pred_7 obj_28)
       (pred_7 obj_13)
       (pred_7 obj_22)
       (pred_7 obj_07)
       (pred_7 obj_24)
       (pred_7 obj_20)
       (pred_7 obj_17)
       (pred_7 obj_02)
       (pred_7 obj_29)
       (pred_7 obj_03)
       (pred_7 obj_26)
       (pred_7 obj_31)
       (pred_7 obj_30)
       (pred_1 obj_01)
       (pred_1 obj_16)
       (pred_1 obj_18)
       (pred_6 obj_14)
       (pred_6 obj_09)
       (pred_6 obj_21)
       (pred_6 obj_19)

       (pred_5 obj_23 obj_15)
       (pred_5 obj_23 obj_10)
       (pred_5 obj_10 obj_27)
       (pred_5 obj_10 obj_32)
       (pred_5 obj_10 obj_23)
       (pred_5 obj_32 obj_06)
       (pred_5 obj_32 obj_04)
       (pred_5 obj_32 obj_10)
       (pred_5 obj_04 obj_08)
       (pred_5 obj_04 obj_05)
       (pred_5 obj_04 obj_32)
       (pred_5 obj_05 obj_11)
       (pred_5 obj_05 obj_04)
       (pred_5 obj_15 obj_25)
       (pred_5 obj_15 obj_27)
       (pred_5 obj_15 obj_23)
       (pred_5 obj_27 obj_12)
       (pred_5 obj_27 obj_06)
       (pred_5 obj_27 obj_10)
       (pred_5 obj_27 obj_15)
       (pred_5 obj_06 obj_28)
       (pred_5 obj_06 obj_08)
       (pred_5 obj_06 obj_32)
       (pred_5 obj_06 obj_27)
       (pred_5 obj_08 obj_13)
       (pred_5 obj_08 obj_11)
       (pred_5 obj_08 obj_04)
       (pred_5 obj_08 obj_06)
       (pred_5 obj_11 obj_22)
       (pred_5 obj_11 obj_05)
       (pred_5 obj_11 obj_08)
       (pred_5 obj_25 obj_07)
       (pred_5 obj_25 obj_12)
       (pred_5 obj_25 obj_15)
       (pred_5 obj_12 obj_24)
       (pred_5 obj_12 obj_28)
       (pred_5 obj_12 obj_27)
       (pred_5 obj_12 obj_25)
       (pred_5 obj_28 obj_20)
       (pred_5 obj_28 obj_13)
       (pred_5 obj_28 obj_06)
       (pred_5 obj_28 obj_12)
       (pred_5 obj_13 obj_17)
       (pred_5 obj_13 obj_22)
       (pred_5 obj_13 obj_08)
       (pred_5 obj_13 obj_28)
       (pred_5 obj_22 obj_02)
       (pred_5 obj_22 obj_11)
       (pred_5 obj_22 obj_13)
       (pred_5 obj_07 obj_29)
       (pred_5 obj_07 obj_24)
       (pred_5 obj_07 obj_25)
       (pred_5 obj_24 obj_03)
       (pred_5 obj_24 obj_20)
       (pred_5 obj_24 obj_12)
       (pred_5 obj_24 obj_07)
       (pred_5 obj_20 obj_26)
       (pred_5 obj_20 obj_17)
       (pred_5 obj_20 obj_28)
       (pred_5 obj_20 obj_24)
       (pred_5 obj_17 obj_31)
       (pred_5 obj_17 obj_02)
       (pred_5 obj_17 obj_13)
       (pred_5 obj_17 obj_20)
       (pred_5 obj_02 obj_30)
       (pred_5 obj_02 obj_22)
       (pred_5 obj_02 obj_17)
       (pred_5 obj_29 obj_03)
       (pred_5 obj_29 obj_07)
       (pred_5 obj_03 obj_26)
       (pred_5 obj_03 obj_24)
       (pred_5 obj_03 obj_29)
       (pred_5 obj_26 obj_31)
       (pred_5 obj_26 obj_20)
       (pred_5 obj_26 obj_03)
       (pred_5 obj_31 obj_30)
       (pred_5 obj_31 obj_17)
       (pred_5 obj_31 obj_26)
       (pred_5 obj_30 obj_02)
       (pred_5 obj_30 obj_31)
       (pred_11 obj_02)
       (pred_11 obj_05)
       (pred_11 obj_23)
       (pred_11 obj_17)
       (pred_9  obj_02 obj_01)
       (pred_9  obj_05 obj_16)
       (pred_9  obj_23 obj_18)
       (pred_9  obj_17 obj_16)
       (pred_2 obj_10)
       (pred_2 obj_32)
       (pred_2 obj_04)
       (pred_2 obj_15)
       (pred_2 obj_27)
       (pred_2 obj_06)
       (pred_2 obj_08)
       (pred_2 obj_11)
       (pred_2 obj_25)
       (pred_2 obj_12)
       (pred_2 obj_28)
       (pred_2 obj_13)
       (pred_2 obj_22)
       (pred_2 obj_07)
       (pred_2 obj_24)
       (pred_2 obj_20)
       (pred_2 obj_29)
       (pred_2 obj_03)
       (pred_2 obj_26)
       (pred_2 obj_31)
       (pred_2 obj_30)

       (pred_3  obj_14 obj_01)
       (pred_3  obj_09 obj_16)
       (pred_3  obj_21 obj_18)
       (pred_3  obj_19 obj_01)
       (pred_10 obj_14 obj_22)
       (pred_10 obj_09 obj_15)
       (pred_10 obj_21 obj_05)
       (pred_10 obj_19 obj_26)
       (pred_8 obj_26)
    )

    (:goal (and
       (pred_10 obj_09 obj_22)
       (pred_10 obj_19 obj_04)
    ))
(:constraints
  (always (not (pred_8 obj_08)))
)
)

; plan
1. (op_1 obj_26 obj_19)
   deleted: (pred_10 obj_19 obj_26) (pred_12)
   added: (pred_4 obj_19)
   goals met: 0 of 2
2. (op_2 obj_26 obj_20)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_20)
   goals met: 0 of 2
3. (op_2 obj_20 obj_28)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_28)
   goals met: 0 of 2
4. (op_2 obj_28 obj_06)
   deleted: (pred_8 obj_28)
   added: (pred_8 obj_06)
   goals met: 0 of 2
5. (op_2 obj_06 obj_32)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_32)
   goals met: 0 of 2
6. (op_2 obj_32 obj_04)
   deleted: (pred_8 obj_32)
   added: (pred_8 obj_04)
   goals met: 0 of 2
7. (op_5 obj_04 obj_19)
   deleted: (pred_4 obj_19)
   added: (pred_12) (pred_10 obj_19 obj_04)
   goals met: 1 of 2
8. (op_2 obj_04 obj_32)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_32)
   goals met: 1 of 2
9. (op_2 obj_32 obj_06)
   deleted: (pred_8 obj_32)
   added: (pred_8 obj_06)
   goals met: 1 of 2
10. (op_2 obj_06 obj_27)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_27)
   goals met: 1 of 2
11. (op_2 obj_27 obj_15)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_15)
   goals met: 1 of 2
12. (op_1 obj_15 obj_09)
   deleted: (pred_10 obj_09 obj_15) (pred_12)
   added: (pred_4 obj_09)
   goals met: 1 of 2
13. (op_2 obj_15 obj_27)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_27)
   goals met: 1 of 2
14. (op_2 obj_27 obj_06)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_06)
   goals met: 1 of 2
15. (op_2 obj_06 obj_28)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_28)
   goals met: 1 of 2
16. (op_2 obj_28 obj_13)
   deleted: (pred_8 obj_28)
   added: (pred_8 obj_13)
   goals met: 1 of 2
17. (op_2 obj_13 obj_22)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_22)
   goals met: 1 of 2
18. (op_4 obj_22 obj_14 obj_09)
   deleted: (pred_4 obj_09) (pred_10 obj_14 obj_22)
   added: (pred_4 obj_14) (pred_10 obj_09 obj_22)
   goals met: 2 of 2
